update readme with diagrams and screenshots
